# Durações (semicolcheia = 1)
dur_dic = {
    "Semibreve pontuada": 20,
    "Semibreve": 16,
    "Mínima pontuada": 12,
    "Mínima": 8,
    "Semínima pontuada": 6,
    "Semínima": 4,
    "Colcheia pontuada": 3,
    "Colcheia": 2,
    "Semicolcheia pontuada": 1.5,
    "Semicolcheia": 1,
    "Fusa pontuada": 0.75,
    "Fusa": 0.5,
    "Semifusa": 0.25,
}

# Dicionário de durações lilypond
lilydur = {
    20: "1.",
    16: "1",
    12: "2.",
    8: "2",
    6: "4.",
    4: "4",
    3: "8.",
    2: "8",
    1.5: "16.",
    1: "16",
    0.75: "32.",
    0.5: "32",
    0.25: "64",
}

# Fórmulas de compasso quebradas
form_compasso = {
    "7/4": [7, 4],
    "6/4": [6, 4],
    "5/4": [5, 4],
    "4/4": [4, 4],
    "3/4": [3, 4],
    "2/4": [2, 4],
    "7/8": [7, 8],
    "6/8": [6, 8],
    "5/8": [5, 8],
    "3/8": [3, 8],
    "7/16": [7, 16],
    "5/16": [5, 16],
}

# Agrupamento de compassos
agrupamento = {
    "7/4": [4, 4, 4, 4, 4, 4, 4],
    "6/4": [4, 4, 4, 4, 4, 4],
    "5/4": [4, 4, 4, 4, 4],
    "4/4": [4, 4, 4, 4],
    "3/4": [4, 4, 4],
    "2/4": [4, 4],
    "7/8": [4, 4, 6],
    "6/8": [6, 6],
    "5/8": [6, 4],
    "3/8": [4, 2],
    "7/16": [4, 3],
    "5/16": [3, 2],
}

# Quebras de compasso
quebras = {
    "7/4": 1 * (7 * 4),
    "6/4": 1 * (6 * 4),
    "5/4": 2 * (5 * 4),
    "4/4": 2 * (4 * 4),
    "3/4": 3 * (3 * 4),
    "2/4": 4 * (2 * 4),
    "7/8": 3 * (7 * 2),
    "6/8": 3 * (6 * 2),
    "5/8": 4 * (5 * 2),
    "3/8": 6 * (3 * 2),
    "7/16": 4 * 7,
    "5/16": 6 * 5,
}
